target/classes/test.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" name="Service1" targetNamespace="http://tempuri.org/">
<wsdl:types>
<xsd:schema targetNamespace="http://tempuri.org/Imports">
<xsd:import schemaLocation="http://203.123.134.135/PayFino/Service/Service1.svc?xsd=xsd0" namespace="http://tempuri.org/"/>
<xsd:import schemaLocation="http://203.123.134.135/PayFino/Service/Service1.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
<xsd:import schemaLocation="http://203.123.134.135/PayFino/Service/Service1.svc?xsd=xsd2" namespace="http://schemas.datacontract.org/2004/07/FinoAPI.Models"/>
<xsd:import schemaLocation="http://203.123.134.135/PayFino/Service/Service1.svc?xsd=xsd3" namespace="http://schemas.datacontract.org/2004/07/FinoAPI.Common"/>
</xsd:schema>
</wsdl:types>
<wsdl:message name="IService1_GetContractDetails_InputMessage">
<wsdl:part name="parameters" element="tns:GetContractDetails"/>
</wsdl:message>
<wsdl:message name="IService1_GetContractDetails_OutputMessage">
<wsdl:part name="parameters" element="tns:GetContractDetailsResponse"/>
</wsdl:message>
<wsdl:message name="IService1_SendStatus_InputMessage">
<wsdl:part name="parameters" element="tns:SendStatus"/>
</wsdl:message>
<wsdl:message name="IService1_SendStatus_OutputMessage">
<wsdl:part name="parameters" element="tns:SendStatusResponse"/>
</wsdl:message>
<wsdl:portType name="IService1">
<wsdl:operation name="GetContractDetails">
<wsdl:input wsaw:Action="http://tempuri.org/IService1/GetContractDetails" message="tns:IService1_GetContractDetails_InputMessage"/>
<wsdl:output wsaw:Action="http://tempuri.org/IService1/GetContractDetailsResponse" message="tns:IService1_GetContractDetails_OutputMessage"/>
</wsdl:operation>
<wsdl:operation name="SendStatus">
<wsdl:input wsaw:Action="http://tempuri.org/IService1/SendStatus" message="tns:IService1_SendStatus_InputMessage"/>
<wsdl:output wsaw:Action="http://tempuri.org/IService1/SendStatusResponse" message="tns:IService1_SendStatus_OutputMessage"/>
</wsdl:operation>
</wsdl:portType>
<wsdl:binding name="BasicHttpBinding_IService1" type="tns:IService1">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
<wsdl:operation name="GetContractDetails">
<soap:operation soapAction="http://tempuri.org/IService1/GetContractDetails" style="document"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
<wsdl:operation name="SendStatus">
<soap:operation soapAction="http://tempuri.org/IService1/SendStatus" style="document"/>
<wsdl:input>
<soap:body use="literal"/>
</wsdl:input>
<wsdl:output>
<soap:body use="literal"/>
</wsdl:output>
</wsdl:operation>
</wsdl:binding>
<wsdl:service name="Service1">
<wsdl:port name="BasicHttpBinding_IService1" binding="tns:BasicHttpBinding_IService1">
<soap:address location="http://203.123.134.135/PayFino/Service/Service1.svc"/>
</wsdl:port>
</wsdl:service>
</wsdl:definitions>
